GopalSaraf/Practicals/PSDL/include/proc/pic18f66k22.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F66K22_INC_
#define _PIC18F66K22_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18F66K22
 */

/*
 * Device Registers
 */

// Register: PMD3
#define PMD3 PMD3
PMD3                                     equ 0F16h
// bitfield definitions
PMD3_TMR12MD_POSN                        equ 0000h
PMD3_TMR12MD_POSITION                    equ 0000h
PMD3_TMR12MD_SIZE                        equ 0001h
PMD3_TMR12MD_LENGTH                      equ 0001h
PMD3_TMR12MD_MASK                        equ 0001h
PMD3_CCP4MD_POSN                         equ 0001h
PMD3_CCP4MD_POSITION                     equ 0001h
PMD3_CCP4MD_SIZE                         equ 0001h
PMD3_CCP4MD_LENGTH                       equ 0001h
PMD3_CCP4MD_MASK                         equ 0002h
PMD3_CCP5MD_POSN                         equ 0002h
PMD3_CCP5MD_POSITION                     equ 0002h
PMD3_CCP5MD_SIZE                         equ 0001h
PMD3_CCP5MD_LENGTH                       equ 0001h
PMD3_CCP5MD_MASK                         equ 0004h
PMD3_CCP6MD_POSN                         equ 0003h
PMD3_CCP6MD_POSITION                     equ 0003h
PMD3_CCP6MD_SIZE                         equ 0001h
PMD3_CCP6MD_LENGTH                       equ 0001h
PMD3_CCP6MD_MASK                         equ 0008h
PMD3_CCP7MD_POSN                         equ 0004h
PMD3_CCP7MD_POSITION                     equ 0004h
PMD3_CCP7MD_SIZE                         equ 0001h
PMD3_CCP7MD_LENGTH                       equ 0001h
PMD3_CCP7MD_MASK                         equ 0010h
PMD3_CCP8MD_POSN                         equ 0005h
PMD3_CCP8MD_POSITION                     equ 0005h
PMD3_CCP8MD_SIZE                         equ 0001h
PMD3_CCP8MD_LENGTH                       equ 0001h
PMD3_CCP8MD_MASK                         equ 0020h
PMD3_CCP9MD_POSN                         equ 0006h
PMD3_CCP9MD_POSITION                     equ 0006h
PMD3_CCP9MD_SIZE                         equ 0001h
PMD3_CCP9MD_LENGTH                       equ 0001h
PMD3_CCP9MD_MASK                         equ 0040h
PMD3_CCP10MD_POSN                        equ 0007h
PMD3_CCP10MD_POSITION                    equ 0007h
PMD3_CCP10MD_SIZE                        equ 0001h
PMD3_CCP10MD_LENGTH                      equ 0001h
PMD3_CCP10MD_MASK                        equ 0080h

// Register: PMD2
#define PMD2 PMD2
PMD2                                     equ 0F17h
// bitfield definitions
PMD2_CMP1MD_POSN                         equ 0000h
PMD2_CMP1MD_POSITION                     equ 0000h
PMD2_CMP1MD_SIZE                         equ 0001h
PMD2_CMP1MD_LENGTH                       equ 0001h
PMD2_CMP1MD_MASK                         equ 0001h
PMD2_CMP2MD_POSN                         equ 0001h
PMD2_CMP2MD_POSITION                     equ 0001h
PMD2_CMP2MD_SIZE                         equ 0001h
PMD2_CMP2MD_LENGTH                       equ 0001h
PMD2_CMP2MD_MASK                         equ 0002h
PMD2_CMP3MD_POSN                         equ 0002h
PMD2_CMP3MD_POSITION                     equ 0002h
PMD2_CMP3MD_SIZE                         equ 0001h
PMD2_CMP3MD_LENGTH                       equ 0001h
PMD2_CMP3MD_MASK                         equ 0004h
PMD2_TMR5MD_POSN                         equ 0003h
PMD2_TMR5MD_POSITION                     equ 0003h
PMD2_TMR5MD_SIZE                         equ 0001h
PMD2_TMR5MD_LENGTH                       equ 0001h
PMD2_TMR5MD_MASK                         equ 0008h
PMD2_TMR6MD_POSN                         equ 0004h
PMD2_TMR6MD_POSITION                     equ 0004h
PMD2_TMR6MD_SIZE                         equ 0001h
PMD2_TMR6MD_LENGTH                       equ 0001h
PMD2_TMR6MD_MASK                         equ 0010h
PMD2_TMR7MD_POSN                         equ 0005h
PMD2_TMR7MD_POSITION                     equ 0005h
PMD2_TMR7MD_SIZE                         equ 0001h
PMD2_TMR7MD_LENGTH                       equ 0001h
PMD2_TMR7MD_MASK                         equ 0020h
PMD2_TMR8MD_POSN                         equ 0006h
PMD2_TMR8MD_POSITION                     equ 0006h
PMD2_TMR8MD_SIZE                         equ 0001h
PMD2_TMR8MD_LENGTH                       equ 0001h
PMD2_TMR8MD_MASK                         equ 0040h
PMD2_TMR10MD_POSN                        equ 0007h
PMD2_TMR10MD_POSITION                    equ 0007h
PMD2_TMR10MD_SIZE                        equ 0001h
PMD2_TMR10MD_LENGTH                      equ 0001h
PMD2_TMR10MD_MASK                        equ 0080h

// Register: PMD1
#define PMD1 PMD1
PMD1                                     equ 0F18h
// bitfield definitions
PMD1_TMR1MD_POSN                         equ 0001h
PMD1_TMR1MD_POSITION                     equ 0001h
PMD1_TMR1MD_SIZE                         equ 0001h
PMD1_TMR1MD_LENGTH                       equ 0001h
PMD1_TMR1MD_MASK                         equ 0002h
PMD1_TMR2MD_POSN                         equ 0002h
PMD1_TMR2MD_POSITION                     equ 0002h
PMD1_TMR2MD_SIZE                         equ 0001h
PMD1_TMR2MD_LENGTH                       equ 0001h
PMD1_TMR2MD_MASK                         equ 0004h
PMD1_TMR3MD_POSN                         equ 0003h
PMD1_TMR3MD_POSITION                     equ 0003h
PMD1_TMR3MD_SIZE                         equ 0001h
PMD1_TMR3MD_LENGTH                       equ 0001h
PMD1_TMR3MD_MASK                         equ 0008h
PMD1_TMR4MD_POSN                         equ 0004h
PMD1_TMR4MD_POSITION                     equ 0004h
PMD1_TMR4MD_SIZE                         equ 0001h
PMD1_TMR4MD_LENGTH                       equ 0001h
PMD1_TMR4MD_MASK                         equ 0010h
PMD1_RTCCMD_POSN                         equ 0005h
PMD1_RTCCMD_POSITION                     equ 0005h
PMD1_RTCCMD_SIZE                         equ 0001h
PMD1_RTCCMD_LENGTH                       equ 0001h
PMD1_RTCCMD_MASK                         equ 0020h
PMD1_CTMUMD_POSN                         equ 0006h
PMD1_CTMUMD_POSITION                     equ 0006h
PMD1_CTMUMD_SIZE                         equ 0001h
PMD1_CTMUMD_LENGTH                       equ 0001h
PMD1_CTMUMD_MASK                         equ 0040h
PMD1_PSPMD_POSN                          equ 0007h
PMD1_PSPMD_POSITION                      equ 0007h
PMD1_PSPMD_SIZE                          equ 0001h
PMD1_PSPMD_LENGTH                        equ 0001h
PMD1_PSPMD_MASK                          equ 0080h

